public class StaticMaze {
    /**
     * Метод создания cтатического лабиринта
     * @param maze лабиринт в виде массива int[10][10], стенки имеют вес = -1
     */
    public int[][] staticMaze(){
        int[][] maze =
                {{-1, -1, -1, -1, -1, -1, -1, -1, -1, -1},
                        {-1, 0, 0, 0, 0, 0, 0, 0, 0, -1},
                        {-1, 0, -1, -1, -1, -1, 0, 0, 0, -1},
                        {-1, 0, 0, 0, -1, 0, 0, 0, 0, -1},
                        {-1, 0, 0, 0, -1, 0, 0, 0, 0, -1},
                        {-1, 0, 0, 0, -1, 0, 0, 0, 0, -1},
                        {-1, 0, -1, -1, -1, -1, -1, -1, 0, -1},
                        {-1, 0, 0, 0, -1, 0, 0, 0, 0, -1},
                        {-1, 0, 0, 0, 0, 0, 0, 0, 0, -1},
                        {-1, -1, -1, -1, -1, -1, -1, -1, -1, -1}};

        return maze;
    }
}
